import './bootstrap';

function App() {
  return (
    <>
      <form className='card' method='POST'>
        <h1>Пополнить банковской картой</h1>

        <div className='card__body'>
          <div className='card__amount'>
            <p>Укажите сумму</p>
            <div>
              <div className='amount amount_usd'>
                <input type="number" placeholder='0000.00'/>
                <svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M8.2301 14.2189V17.472H5.72564V14.2189H5.485C4.0055 14.2189 2.72802 13.7703 1.65256 12.8731C0.583038 11.9699 0.0482788 10.8499 0.0482788 9.51301C0.0482788 9.33476 0.0542206 9.13868 0.0661041 8.92477C0.0779877 8.70493 0.095813 8.51182 0.11958 8.34545L2.62404 8.64848L2.58839 9.04955C2.5765 9.18621 2.57056 9.3199 2.57056 9.45062C2.57056 10.2468 2.86765 10.9153 3.46183 11.456C4.06194 11.9907 4.81655 12.2581 5.72564 12.2581V6.40249C4.35309 6.40249 3.30437 6.16482 2.57947 5.68948C1.85458 5.2082 1.49213 4.5338 1.49213 3.66631C1.49213 2.75127 1.85755 2.04717 2.58839 1.55401C3.31922 1.0549 4.36498 0.805344 5.72564 0.805344H8.2301V4.40606C10.0067 4.40606 11.403 4.86654 12.419 5.78752C13.4351 6.70849 13.9431 7.96815 13.9431 9.56648C13.9431 10.9985 13.4291 12.1333 12.4012 12.9711C11.3792 13.803 9.98886 14.2189 8.2301 14.2189ZM5.72564 2.63244C5.04234 2.63244 4.54917 2.71265 4.24614 2.87308C3.94905 3.02757 3.80051 3.26227 3.80051 3.57718C3.80051 3.88021 3.96094 4.09411 4.28179 4.21889C4.60859 4.34367 5.08987 4.40606 5.72564 4.40606V2.63244ZM8.2301 6.42032V12.2581C9.21643 12.2581 9.98886 12.0115 10.5474 11.5184C11.1059 11.0252 11.3852 10.3627 11.3852 9.53083C11.3852 8.48508 11.1297 7.70671 10.6187 7.19572C10.1136 6.67878 9.31744 6.42032 8.2301 6.42032Z" fill="#8F90A6"/>
                </svg>
              </div>
              <div className='amount amount_rub'>
                <input type="number" placeholder='0000.00'/>
                <svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M8.46006 10.6462C12.0405 10.6462 13.7051 8.47915 13.7051 5.87235C13.7051 3.26555 12.0405 1.09846 8.46006 1.09846H2.83817V8.91885H0.294184V10.6462H2.83817V12.1538H0.294184V13.8812H2.83817V17.1789H4.78541V13.8812H8.33443V12.1538H4.78541V10.6462H8.46006ZM4.78541 8.91885V2.82585H8.46006C10.7214 2.82585 11.7892 4.11355 11.7892 5.87235C11.7892 7.63116 10.7214 8.91885 8.46006 8.91885H4.78541Z" fill="#8F90A6"/>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M2.54581 0.805336H8.46079C10.3114 0.805336 11.7037 1.36685 12.6337 2.30105C13.5621 3.23373 13.9989 4.507 13.9989 5.87232C13.9989 7.23764 13.5621 8.51091 12.6337 9.44359C11.7037 10.3778 10.3114 10.9393 8.46079 10.9393H5.07924V11.8607H8.62825V14.1742H5.07924V17.472H2.54581V14.1742H0.00183105V11.8607H2.54581V10.9393H0.00183105V8.62573H2.54581V0.805336ZM2.83817 1.09846H8.46006C12.0405 1.09846 13.7051 3.26555 13.7051 5.87235C13.7051 8.47915 12.0405 10.6462 8.46006 10.6462H4.78541V12.1538H8.33443V13.8812H4.78541V17.1789H2.83817V13.8812H0.294184V12.1538H2.83817V10.6462H0.294184V8.91885H2.83817V1.09846ZM5.07924 3.11891V8.62573H8.46079C9.53612 8.62573 10.2865 8.3206 10.7676 7.84639C11.2489 7.372 11.4969 6.69272 11.4969 5.87232C11.4969 5.05192 11.2489 4.37264 10.7676 3.89825C10.2865 3.42404 9.53612 3.11891 8.46079 3.11891H5.07924ZM4.78541 8.91885H8.46006C10.7214 8.91885 11.7892 7.63116 11.7892 5.87235C11.7892 4.11355 10.7214 2.82585 8.46006 2.82585H4.78541V8.91885Z" fill="#8F90A6"/>
                </svg>  
              </div>
            </div>
          </div>
          <div className='card__saved'>
            <div className='saved saved_existed'>
              <p><span>• • • •</span> 3282</p>
              <p><span>12</span> / <span>23</span></p>
            </div>
            <div className='saved saved_new'>
              <div>
                <svg width="28" height="29" viewBox="0 0 28 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M14 5.97201V22.3053" stroke="#7B8794" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                  <path d="M5.83331 14.1387H22.1666" stroke="#7B8794" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>
                <p>Новая карта</p>
              </div>
            </div>
          </div>
          <div className='card__new'>
            <div className='new new_front'>
              <div className='form-group'>
                <label>Номер карты</label>
                <input type="number" placeholder='Номер карты'/>
              </div>
              <div className='form-group'>
                <label>Действует до</label>
                <div className='form-group form-group_multiple'>
                  <input type="number" placeholder='ММ'/>
                  <span>/</span>
                  <input type="number" placeholder='ГГ'/>
                </div>
              </div>
            </div>
            <div className='new new_back'>
              <div className='line'>

              </div>
              <div className='form-group'>
                <div>
                  <label>CVV/CVC</label>
                  <input type="number" placeholder='000'/>
                </div>
                <span className='info'>
                  три цифры
                  <br/>с обратной стороны
                  <br/>карты
                </span>
              </div>
            </div>
          </div>
          <div className='card__terms'>
            <input className='terms terms_input' type="checkbox" name="" id="" />
            <div className='terms terms_text'>
              <p>
                Запомнить эту карту. Это безопасно.
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M0.833313 10.1387C0.833313 5.07607 4.93737 0.972015 9.99998 0.972015C15.0626 0.972015 19.1666 5.07607 19.1666 10.1387C19.1666 15.2013 15.0626 19.3053 9.99998 19.3053C4.93737 19.3053 0.833313 15.2013 0.833313 10.1387ZM9.99998 2.63868C5.85784 2.63868 2.49998 5.99655 2.49998 10.1387C2.49998 14.2808 5.85784 17.6387 9.99998 17.6387C14.1421 17.6387 17.5 14.2808 17.5 10.1387C17.5 5.99655 14.1421 2.63868 9.99998 2.63868Z" fill="#C7C9D9"/>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M9.99998 5.97201C10.4602 5.97201 10.8333 6.34511 10.8333 6.80535V10.1387C10.8333 10.5989 10.4602 10.972 9.99998 10.972C9.53974 10.972 9.16665 10.5989 9.16665 10.1387V6.80535C9.16665 6.34511 9.53974 5.97201 9.99998 5.97201Z" fill="#C7C9D9"/>
                  <path d="M10.8333 13.472C10.8333 13.9323 10.4602 14.3053 9.99998 14.3053C9.53974 14.3053 9.16665 13.9323 9.16665 13.472C9.16665 13.0118 9.53974 12.6387 9.99998 12.6387C10.4602 12.6387 10.8333 13.0118 10.8333 13.472Z" fill="#C7C9D9"/>
                </svg>
              </p>
              <p className='link'>Сохраняя карту, вы соглашаетесь с&nbsp;<a href="#"> условиями привязки карты.</a></p>
            </div>
          </div>
        </div>

        <input className='card__submit' type="submit" value={"Оплатить"} />

      </form>
    </>
  )
}

export default App
